In [54]:
import sqlite3
import pandas as pd
from datetime import datetime
import creditcard
from sklearn.metrics.pairwise import cosine_similarity

from sentence_transformers import SentenceTransformer
import nltk
nltk.download('punkt')
from nltk.tokenize import word_tokenize
import re
import creditcard

[nltk_data] Downloading package punkt to /home/zq/nltk_data...
[nltk_data]   Package punkt is already up-to-date!

In [3]:
# create the connection object
conn = sqlite3.connect("new.db")
# get a cursor object used to execute SQL commands
cursor = conn.cursor()

In [20]:
def check_if_table_exists(table_name):
    """Returns True if table exists, otherwise creates table and returns True"""
    check_query = f"""SELECT name FROM sqlite_master WHERE type='table' AND name='{table_name}';"""
    cursor.execute(check_query)
    result=cursor.fetchone()
    if not result:
        # Creating table
        create_query = """ CREATE TABLE monthly_summary (
                    datetime DATETIME NOT NULL,
                    income_amt REAL NOT NULL,
                    income_type VARCHAR(255) NOT NULL,
                    expense_amt REAL NOT NULL,
                    expense_type VARCHAR(255) NOT NULL,
                    comment VARCHAR(255)
                ); """

        cursor.execute(create_query)
        return True
    return result

In [21]:
check_if_table_exists("monthly_summary")

('monthly_summary',)

In [27]:
df = pd.DataFrame(columns = ['datetime', 'income_amt', 'income_type', 'expense_amt', 'expense_type', 'comment'])

In [28]:
df.loc[len(df)] = [datetime.now(), 100, 'salary', 50, 'food', 'comment']

In [33]:
df.loc[len(df)] = [datetime.now(), 120, 'salary', 50, 'groceries', 'etcccc']

In [34]:
df

,datetime,income_amt,income_type,expense_amt,expense_type,comment
0,2023-04-02 10:48:53.293997,100,salary,50,food,comment
1,2023-04-02 11:19:21.175542,120,salary,50,groceries,etcccc

In [35]:
df.to_sql('monthly_summary', conn, if_exists='append', index=False)

2

In [32]:
from database import get_period

In [ ]:
get_period

In [ ]:
def insert_period(period, incomes, expenses, comment):
    """Returns the report on a successful creation, otherwise raises an error"""
    
    return cursor.executemany('INSERT INTO monthly_summary VALUES(?, ?, ?)', [period, incomes, expenses, comment])
    # return db.put({"key": period, "incomes": incomes, "expenses": expenses, "comment": comment})